enum = {
    'english': 0,
    'german': 1,
    'russian': 2,
    'french': 3,
    'spanish': 4,
    'italian': 5,
    'japanese': 6,
    'korean': 7,
    'chinese': 8,
}

ALL_ENG_PHONES = ['AA0', 'AA1', 'AA2', 'AE0', 'AE1', 'AE2', 'AH0',
              'AH1', 'AH2', 'AO0', 'AO1', 'AO2', 'AW0', 'AW1',
              'AW2', 'AY0', 'AY1', 'AY2', 'B', 'CH', 'D', 'DH',
              'EH0', 'EH1', 'EH2', 'ER0', 'ER1', 'ER2', 'EY0', 'EY1',
              'EY2', 'F', 'G', 'HH', 'IH0', 'IH1', 'IH2', 'IY0', 'IY1',
                 'IY2', 'JH', 'K', 'L', 'M', 'N', 'NG', 'OW0', 'OW1', 'OW2',
              'OY0', 'OY1', 'OY2', 'P', 'R', 'S', 'SH', 'T', 'TH', 'UH0',
              'UH1', 'UH2', 'UW0', 'UW1', 'UW2', 'V', 'W', 'Y', 'Z', 'ZH']

ALL_GER_PHONES = ['a', 'aj', 'aw', 'aː', 'b', 'c', 'cʰ', 'd', 'eː',
                  'f', 'h', 'g', 'iː', 'j', 'k', 'kʰ', 'l', 'l̩', 'm', 'm̩',
                  'n', 'n̩', 'oː', 'p', 'pf', 'pʰ', 's', 't', 'ts',
                  'tʃ', 'tʰ', 'uː', 'v', 'x', 'yː', 'z', 'ç', 'øː', 'ŋ', 'œ',
                  'ɐ', 'ɔ', 'ɔʏ', 'ə', 'ɛ', 'ɟ', 'ɡ', 'ɪ', 'ɲ', 'ʁ', 'ʃ', 'ʊ', 'ʏ','ʀ','æː']

ALL_RUS_PHONES = ['a', 'b', 'bʲ', 'bʲː', 'bː', 'c', 'cː', 'dzʲː', 'dʐː', 'dʲ', 'dʲː', 'd',
                    'd̪', 'd̪z̪', 'd̪z̪ː', 'd̪ː', 'e', 'f', 'fʲ', 'fʲː', 'fː', 'i', 'j', 'jː',
                    'k', 'kː', 'm', 'mʲ', 'mʲː', 'mː', 'n', 'n̪', 'n̪ː', 'o', 'p', 'pʲ', 'pʲː',
                    'pː', 'r', 'rʲ', 'rʲː', 'rː', 'spn', 'sʲ', 'sʲː', 's', 's̪', 's̪ː', 'tsʲ',
                    'tɕ', 'tɕː', 'tʂ', 'tʂː', 'tʲ', 'tʲː', 't', 't͡s', 't̪', 't̪s̪', 't̪s̪ː', 't̪ː', 'u',
                    'v', 'vʲ', 'vʲː', 'vː', 'x', 'xː', 'zʲ', 'zʲː', 'z', 'z̪', 'z̪ː', 'æ', 'ç',
                    'ɐ', 'ɕ', 'ɕː', 'ə', 'ɛ', 'ɟ', 'ɟː', 'ɡ', 'ɡː', 'ɣ', 'ɨ', 'ɪ', 'ɫ',
                    'ɫː', 'ɲ', 'ɲː', 'ɵ', 'ʂ', 'ʂː', 'ʉ', 'ʊ', 'ʎ', 'ʎː', 'ʐ', 'ʐː', 'ʑː']

ALL_FRA_PHONES = ['a', 'b', 'c', 'd', 'dʒ', 'e', 'f', 'i', 'j', 'k', 'l', 'm', 'mʲ', 'n', 'o',
                  'p', 's', 'spn', 't', 'ts', 'tʃ', 'u', 'v', 'w', 'y', 'z', 'ø', 'ŋ', 'œ', 'ɑ',
                  'ɑ̃', 'ɔ', 'ɔ̃', 'ə', 'ɛ', 'ɛ̃', 'ɟ', 'ɡ', 'ɥ', 'ɲ', 'ʁ', 'ʃ', 'ʎ', 'ʒ','ʀ']

ALL_SPA_PHONES = ['a', 'b', 'c', 'd̪', 'e', 'f', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r',
                  's', 'tʃ', 't̪', 'u', 'w', 'x', 'ç', 'ð', 'ŋ', 'ɟ', 'ɟʝ', 'ɡ', 'ɣ',
                  'ɲ', 'ɾ', 'ʃ', 'ʎ', 'ʝ', 'β', 'θ']

ALL_ITA_PHONES = ['a', 'aː', 'b', 'bː', 'd', 'dː', 'd͡ʒ', 'd͡ʒː', 'e', 'eː', 'f', 'fː', 'g', 'hː','i', 'j', 'k', 'kː', 'l', 'lː', 'm', 'mː', 'n', 'nː', 'o', 'oː', 'p', 'pː', 'r','rː', 's', 'sː', 't', 'tː', 't͡s', 't͡ʃ', 't͡ʃː', 'u', 'v', 'vː', 'w', 'x', 'y', 'z','ã', 'æ', 'ð', 'ø', 'ħ', 'œ', 'ɔ', 'ə', 'ɛ', 'ɡ', 'ɡː', 'ɲ', 'ʃ', 'ʎ', 'ẽ']

ALL_JPA_PHONES = ['a', 'aː', 'b', 'bʲ', 'bʲː', 'bː', 'c', 'cː', 'd', 'dz', 'dzː', 'dʑ', 'dʑː',
                  'dʲ', 'dʲː', 'dː', 'e', 'eː', 'h', 'hː', 'i', 'iː', 'i̥', 'j', 'k', 'kː', 'm',
                  'mʲ', 'mʲː', 'mː', 'n', 'nː', 'o', 'oː', 'p', 'pʲ', 'pʲː', 'pː', 's', 'spn',
                  'sː', 't', 'ts', 'tsː', 'tɕ', 'tɕː', 'tʲ', 'tʲː', 'tː', 'v', 'vʲ', 'w', 'wː',
                  'z', 'ç', 'çː', 'ŋ', 'ɕ', 'ɕː', 'ɟ', 'ɟː', 'ɡ', 'ɡː', 'ɨ', 'ɨː', 'ɨ̥', 'ɯ', 'ɯː',
                  'ɯ̥', 'ɰ̃', 'ɲ', 'ɲː', 'ɴ', 'ɴː', 'ɸ', 'ɸʲ', 'ɸʲː', 'ɸː', 'ɾ', 'ɾʲ', 'ɾʲː', 'ɾː', 'ʑ', 'ʔ']

ALL_KOR_PHONES = ['b', 'bʲ', 'bʷ', 'c', 'cʰ', 'cʰː', 'c͈', 'd', 'dʑ', 'dʑʷ', 'dʲ', 'dʷ', 'e',
                  'eː', 'h', 'i', 'iː', 'j', 'k', 'kʰ', 'kʰː', 'kʷ', 'kʷː', 'k̚', 'k͈', 'k͈ʷ',
                  'k͈ː', 'm', 'mʲ', 'mʲː', 'mː', 'n', 'nː', 'o', 'oː', 'p', 'pʰ', 'pʰː', 'pʲ',
                  'pʲː', 'pʷ', 'p̚', 'p͈', 'p͈ʲ', 's', 'sʰ', 'sʰː', 'sʷ', 'sː', 's͈', 's͈ʷ', 't',
                  'tɕ', 'tɕʰ', 'tɕʰː', 'tɕʷ', 'tɕʷː', 'tɕː', 'tɕ͈', 'tɕ͈ʷ', 'tɕ͈ː', 'tʰ', 'tʰː',
                  'tʲ', 'tʷ', 'tʷː', 't̚', 't͈', 't͈ʲ', 't͈ː', 'u', 'uː', 'w', 'x', 'ç', 'ŋ', 'ɐ',
                  'ɕʰ', 'ɕ͈', 'ɛ', 'ɛː', 'ɟ', 'ɡ', 'ɡʷ', 'ɣ', 'ɥ', 'ɦ', 'ɨ', 'ɨː', 'ɭ', 'ɭː', 'ɰ',
                  'ɲ', 'ɸʷ', 'ɾ', 'ɾʲ', 'ɾʷ', 'ʌ', 'ʌː', 'ʎ', 'ʎː', 'ʝ', 'β', 'βʷ']

ALL_ZH_PHONES = ['b', 'c', 'ch', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm', 'n', 'p', 'q', 'r', 's', 'sh', 't', 'x', 'z', 'zh',
                'a', 'ai', 'an', 'ang', 'ao',  'e', 'ei', 'en', 'eng', 'er',  'i', 'ia', 'ian', 'iang', 'iao',
                'ie', 'in', 'ing', 'iong', 'iou', 'o', 'ong', 'ou', 'u', 'ua', 'uai', 'uan', 'uang', 'uei',
                'uen', 'uo', 'v', 'van', 've', 'vn']

ALL_PHONES_LIST = [ALL_ENG_PHONES,ALL_GER_PHONES,ALL_RUS_PHONES,ALL_FRA_PHONES,ALL_SPA_PHONES,ALL_ITA_PHONES,ALL_JPA_PHONES,ALL_KOR_PHONES, ALL_ZH_PHONES]